gordonthree/can-stm32f103-remote/src/main.cpp
  // check if message contains enough data to have node id
  if (message.len >= NODE_ID_SIZE) { 
    memcpy((void *)rxNodeID, (const void *)message.buf, 4); // copy node id from message
    haveRXID = true; // set flag to true if message contains node id

    if (memcmp((const void *)rxNodeID, (const void *)myNodeID, 4) == 0) msgFlag = true; // message is for us, set flag to true
  }

  // if ((!msgFlag) && (message.id <= 0x17F)) { // switch control message but not for us
  //   return; // exit function
  // } 

  switch (msgID) {
    case MSG_NORM_OPER: // normal operation message
      CONSOLE.printf("RX: Normal Operation Message\n");
      FLAG_BEGIN_NORMAL_OPER = true; // set flag to begin normal operation
      // introMsgPtr = introMsgPtr + 1; // increment intro message pointer 4th step
      break;
    case MSG_HALT_OPER: // halt operation message
      CONSOLE.printf("RX: Halt Operation Message\n");
      // introMsgPtr = 0; // reset intro message pointer
      FLAG_BEGIN_NORMAL_OPER = false; // clear flag to halt normal operation
      break;
    case SW_SET_OFF:            // set output switch off
      rxSwitchState(message.buf, 0);
      break;
    case SW_SET_ON:             // set output switch on
      rxSwitchState(message.buf, 1);
      break;
    case SW_MOM_PRESS:          // set output momentary
      rxSwitchState(message.buf, 2);
      break;
    case SW_SET_MODE:           // setup output switch modes
      rxSwitchMode(message.buf);
      break;
    case SW_SET_PWM_DUTY:          // set output switch pwm duty
      rxPWMDuty(message.buf);  
      break;
    case SW_SET_PWM_FREQ:          // set output switch pwm frequency
      rxPWMFreq(message.buf);
      break;
    case SW_SET_MOM_DUR:          // set output switch momentary duration
      rxSwMomDur(message.buf);
      break;
    case SW_SET_BLINK_DELAY:          // set output switch blink delay
      rxSwBlinkDelay(message.buf);
      break;
    case SW_SET_STROBE_PAT:          // set output switch strobe pattern
      rxSwStrobePat(message.buf);
      break;


    case REQ_NODE_INTRO: // request for box introduction, kicks off the introduction sequence
      if (haveRXID) { // check if REQ message contains node id
        // CONSOLE.printf("RX: REQ NODE responding to %02x:%02x:%02x:%02x\n", rxNodeID[0], rxNodeID[1], rxNodeID[2], rxNodeID[3]);
        introMsgPtr = 0; // reset intro message pointer
        FLAG_SEND_INTRODUCTION = true; // set flag to send introduction message
      }
      break;

    case ACK_INTRO:
      if (msgFlag) { // message was sent to our ID
        if (introMsgPtr < introMsgCnt) {
          CONSOLE.printf("RX: INTRO ACK %d fo %d\n", introMsgPtr, introMsgCnt);  
          FLAG_SEND_INTRODUCTION = true; // keep sending introductions until all messages have been acknowledged
          introMsgPtr = introMsgPtr + 1; // increment intro message pointer 1st step
        }
      }
      break;
    

      default:
        if (msgID == DATA_EPOCH) {
          uint8_t epochBytes[4] = {message.buf[0], message.buf[1], message.buf[2], message.buf[3]};
          uint32_t rxTime = 0;
          rxTime = unchunk32(epochBytes);
    
          CONSOLE.printf("RX: EPOCH TIME %u\n", rxTime);
        }

        if (message.len > 0) { // message contains data, check if it is for us
          if (msgFlag) {
            // CONSOLE.printf("RX: MATCH MSG: %03x DATA: %u\n", message.id, message.len);
          } else {
            CONSOLE.printf("RX: NO MATCH MSG: %03x DATA: u%\n", message.id, message.len);
          }
        } else {
          if (msgFlag) {
            // CONSOLE.printf("RX: MATCH MSG: %03x NO DATA\n", message.id);
          } else {
            CONSOLE.printf("RX: NO MATCH MSG: %03x NO DATA\n", message.id);
          } 
        }
      
      
      break;
  }
  
  digitalWrite(LED_BUILTIN, LED_OFF);
  
} // end of handle_rx_message

  
static void loadJSONConfig() {/* 
  CONSOLE.println("Starting JSON Parsing...");

  // Allocate the JsonDocument (use https://arduinojson.org/v6/assistant/ for sizing)
  // StaticJsonDocument doc; // Increased buffer slightly from recommendation

  // Deserialize the JSON input
  DeserializationError error = deserializeJson(doc, jsonInput);

  // Check for parsing errors
  if (error) {
    CONSOLE.print("deserializeJson() failed: ");
    CONSOLE.println(error.c_str());
    return; // Don't continue if parsing failed
  }

  CONSOLE.print("Loading JSON into memory... ");

  for (int i = 0; i <= 7; i++) {
    String currentKey = String(i); // Keys are strings: "0", "1", ...

    // Use doc[currentKey].is<JsonArray>() instead of containsKey()
    if (doc[currentKey].is<JsonArray>()) {
      JsonArray currentArray = doc[currentKey].as<JsonArray>();

      nodeSwitch[i].swState = currentArray[0]; // Set switch state
      nodeSwitch[i].swMode = currentArray[1]; // Set switch mode
      nodeSwitch[i].swType = currentArray[2]; // Set switch type
      nodeSwitch[i].featuresMask[0] = currentArray[3]; // Set feature mask byte 1
      nodeSwitch[i].featuresMask[1] = currentArray[4]; // Set feature mask byte 2
      nodeSwitch[i].pwmDuty = currentArray[5]; // Set PWM duty cycle
      nodeSwitch[i].pwmFreq = currentArray[6]; // Set PWM frequency
      nodeSwitch[i].blinkDelay = currentArray[7]; // Set blink delay
      nodeSwitch[i].momPressDur = currentArray[8]; // Set momentary press duration
      nodeSwitch[i].strobePat = currentArray[9]; // Set strobe pattern
      nodeSwitch[i].stateMemory = currentArray[10]; // Set state memory
      nodeSwitch[i].lastSeen = currentArray[11]; // Set last seen time

    }
  }
  CONSOLE.println("Finished!\n.\n"); */
}



void recvMsg(uint8_t *data, size_t len){
  CONSOLE.println("Received Data...");
  String d = "";
  for(int i=0; i < len; i++){
    d += char(data[i]);
  }
  CONSOLE.println(d);

  if (d == "C0"){
    // vTaskSuspend(canbus_task_handle); // suspend canbus task
    // digitalWrite(LED, HIGH);
  }
  if (d == "C1"){
    // vTaskResume(canbus_task_handle); // resume canbus task
    // digitalWrite(LED, HIGH);
  }
  if (d == "W"){
    // printWifi();
    // digitalWrite(LED, HIGH);
  }

